tsung_output/20170930-0032/websocket-try.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
  <clients>
    <client host="tsung-machine-1" use_controller_vm="true" maxusers="64000"/>
    <client host="tsung-machine-2" use_controller_vm="true" maxusers="64000"/>
  </clients>

  <servers>
    <server host="54.93.41.86" port="6060" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users maxnumber="64000" arrivalrate="1000" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
        <request>
            <websocket type="connect" path="/v0/channels?apikey=AQEAAAABAAD_rAp4DJh05a1HAwFT3A6K"/>
        </request>

        <for var="i" from="1" to="60" incr="1">
            <request>
                <websocket type="message">{"hi":{"id":"send hi message","ver":"0.13","ua":"TinodeWeb/0.13 (MacIntel) tinodejs/0.13"}}</websocket>
            </request>
            <thinktime value="1"/>
        </for>
        
        <request>
            <websocket type="close"/>
        </request>
        
    </session>
  </sessions>
</tsung>